In [75]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [117]:
df = pd.read_csv('titanic.csv')

In [118]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [119]:
inputs = df.drop(['PassengerId','Survived','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns')
target = df[['Survived']]

In [120]:
from sklearn.preprocessing import LabelEncoder
Le_Sex = LabelEncoder()
inputs['Sex_n'] = Le_Sex.fit_transform(inputs['Sex'])
inputs_n = inputs.drop('Sex',axis = 'columns')
inputs_n

     Pclass   Age     Fare  Sex_n
0         3  22.0   7.2500      1
1         1  38.0  71.2833      0
2         3  26.0   7.9250      0
3         1  35.0  53.1000      0
4         3  35.0   8.0500      1
..      ...   ...      ...    ...
886       2  27.0  13.0000      1
887       1  19.0  30.0000      0
888       3   NaN  23.4500      0
889       1  26.0  30.0000      1
890       3  32.0   7.7500      1

[891 rows x 4 columns]

In [121]:
inputs_n['Age'] = inputs_n['Age'].fillna(inputs_n['Age'].median())

In [122]:
inputs_n

     Pclass   Age     Fare  Sex_n
0         3  22.0   7.2500      1
1         1  38.0  71.2833      0
2         3  26.0   7.9250      0
3         1  35.0  53.1000      0
4         3  35.0   8.0500      1
..      ...   ...      ...    ...
886       2  27.0  13.0000      1
887       1  19.0  30.0000      0
888       3  28.0  23.4500      0
889       1  26.0  30.0000      1
890       3  32.0   7.7500      1

[891 rows x 4 columns]

In [123]:
inputs_n['Age'].isnull().sum()

0

In [124]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(inputs_n,target,test_size= 0.2)

In [125]:
len(X_train)

712

In [126]:
len(X_test)

179

In [127]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [128]:
model.fit(X_train,Y_train)

DecisionTreeClassifier()

In [129]:
model.score(X_test,Y_test)

0.770949720670391

In [ ]:
model.predict([['3','22.0','7.2500','1']])